


import User from "../models/User.js";


import asyncHandler from "express-async-handler";




const checkLimit = asyncHandler ( async ( req  , res , next) => {


const user = await User.findById (req.user) // دة جاية من الاوس بتاعنا




const today = new Date().toDateString() // بنشوف تاريخ انهادرة اللى مستخدم عمل فية محاولات بتاعتة وبنرجع تاريخ يوم فقط لان مش عايزين الساعة ووالوقت لان احنا هنحسب باليوم مش بالوقت عشان كدة استخدمت تو سترينج استخدمتها عشان مقارنة تكون صحيحة لاننا هندي للمستخدم تاريخ يومي يستخدم فية محاولات بتاعتة


//  هنشوف بقي تاريخ المستخدم استخدم فية محاولات يعني لو فية تاريخ خلاص نسيبها لو مفيش تاريخ متخزن عندنا يعني اول مرة يخش موقع نديلوة نال يعني قيمة مش موجودة


const lastDate = user.lastAttemptsDate ? user.lastAttemptsDate.toDateString() : null // بقولوة لو مستخدم دة مسجلش تاريخ اول مرة يخش موقع اديلوة نال لكن لو هو مسجل قبل وفية تاريخ خزنلي بقي تاريخ دة بشكل يومي يعني زاي كدة بص تحتك

// Sat Aug 29 2026 14:35:22 GMT+0200 تاريخ كان بيتخزن كدة في داتا بيز لكن بعد ما استخدمت تو سترينج داتا اصبحت خزنت تاريخ باليوم فقط من غير وقت

// "Sat Aug 29 2026" كدة بيتخزن

// استخدمت متغير فوقك دة عشان اقارنوة بتاريخ انهاردة لو مستخدم طلع مسجل قبل كدة وعندة تاريخ وعد حدود بتاعتوة نبدأ نجددلوة 5 محاولات تانين في اليوم التاني اليوم بعدة



// if( lastDate !==today ) {

// user.attempts = 0 // قيمة صفرية قيمة ديفولت نبدأ بقي نجددلوة محاولات لو في حالة اليوم وتاريخ انهاردة مش نفس تاريخ انهاردة جددلوة محاولات خلية يبقي عندوة محاولات جديدة في يوم جديد وبتاريخ جديد ويوم جديد 

// user.lastAttemptsDate = new Date() // بنسجل تاريخ واليوم عمل فية محاولات في يوم دة


// // Sat Aug 29 2026 !== Sat Aug 29 2026 الشرط دة مش هيتنفذ عشان طبعا دة نفس يوم فمش هيجددلوة محاولة

// // Sat Aug 29 2026 === Sat Aug 30 2026 هيجددلوة محاولة لانهم مش نفس تاريخ ولا نفس يوم

// }




// if(user.attempts >= 10) {


// return res.status(403).json({ message : "You've used all your free attempts , please try it tomorrow" })

// }



// user.attempts +=1 // يبدأ يزود ويديلوة محاولات لحد ما يخلصها ويوصل لحد رقم 5 اول ما يوصل رقم 5 كدة انت عديت الحد الادني اليومي يبقي تعالي بكرة وجرب تاني


await user.save()


next()

    
})


export default checkLimit












